Бух_тест/src/InformationRegisters/ДанныеПервичныхДокументов/ДанныеПервичныхДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДанныеПервичныхДокументов</name>
  <resources>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаРегистратора</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>НомерРегистратора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.ОтчетПроизводстваЗаСмену</types>
      <types>DocumentRef.СписаниеОС</types>
      <types>DocumentRef.ПлатежныйОрдерСписаниеДенежныхСредств</types>
      <types>DocumentRef.ПередачаОС</types>
      <types>DocumentRef.СписаниеТоваров</types>
      <types>DocumentRef.АвансовыйОтчет</types>
      <types>DocumentRef.ГТДИмпорт</types>
      <types>DocumentRef.ОприходованиеТоваров</types>
      <types>DocumentRef.СписаниеМалоценныхАктивовИзЭксплуатации</types>
      <types>DocumentRef.СписаниеСРасчетногоСчета</types>
      <types>DocumentRef.ПередачаМалоценныхАктивовВЭксплуатацию</types>
      <types>DocumentRef.МодернизацияНМА</types>
      <types>DocumentRef.ДокументРасчетовСКонтрагентом</types>
      <types>DocumentRef.ВводВЭксплуатациюОС</types>
      <types>DocumentRef.ПлатежныйОрдерПоступлениеДенежныхСредств</types>
      <types>DocumentRef.ИндексацияОС</types>
      <types>DocumentRef.РасходныйКассовыйОрдер</types>
      <types>DocumentRef.АктСверкиВзаиморасчетов</types>
      <types>DocumentRef.ОперацияБух</types>
      <types>DocumentRef.ПокупкаПродажаВалюты</types>
      <types>DocumentRef.НалоговаяНакладная</types>
      <types>DocumentRef.АктОбОказанииПроизводственныхУслуг</types>
      <types>DocumentRef.ОпределениеФинансовыхРезультатов</types>
      <types>DocumentRef.ПоступлениеНМА</types>
      <types>DocumentRef.КорректировкаДолга</types>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
      <types>DocumentRef.КомандировкиОрганизаций</types>
      <types>DocumentRef.МодернизацияОС</types>
      <types>DocumentRef.ПереоценкаТоваровВРознице</types>
      <types>DocumentRef.Приложение1КНалоговойНакладной</types>
      <types>DocumentRef.ВозвратТоваровОтПокупателя</types>
      <types>DocumentRef.СчетНаОплатуПокупателю</types>
      <types>DocumentRef.ПередачаТоваров</types>
      <types>DocumentRef.ПоступлениеНаРасчетныйСчет</types>
      <types>DocumentRef.ТребованиеНакладная</types>
      <types>DocumentRef.РегистрацияАвансовВНалоговомУчете</types>
      <types>DocumentRef.ОтчетКомиссионераОПродажах</types>
      <types>DocumentRef.ОтчетКомитентуОПродажах</types>
      <types>DocumentRef.ПодготовкаКПередачеОС</types>
      <types>DocumentRef.ЗакрытиеМесяца</types>
      <types>DocumentRef.РегистрацияВходящегоНалоговогоДокумента</types>
      <types>DocumentRef.ВводНачальныхОстатков</types>
      <types>DocumentRef.ПередачаОборудованияВМонтаж</types>
      <types>DocumentRef.ПереоценкаОС</types>
      <types>DocumentRef.ПередачаНМА</types>
      <types>DocumentRef.ОтчетОРозничныхПродажах</types>
      <types>DocumentRef.КомплектацияНоменклатуры</types>
      <types>DocumentRef.ПриходныйКассовыйОрдер</types>
      <types>DocumentRef.ПоступлениеИзПереработки</types>
      <types>DocumentRef.РеализацияУслугПоПереработке</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ВозвратТоваровПоставщику</types>
      <types>DocumentRef.ИнвентаризацияНЗП</types>
      <types>DocumentRef.ПартияМалоценныхАктивовВЭксплуатации</types>
      <types>DocumentRef.ИнвентаризацияОС</types>
      <types>DocumentRef.ИнвентаризацияТоваровНаСкладе</types>
      <types>DocumentRef.СчетНаОплатуПоставщика</types>
      <types>DocumentRef.ПриемНаРаботу</types>
      <types>DocumentRef.РасчетыПоНалогуНаПрибыль</types>
      <types>DocumentRef.ИнвентаризацияНМА</types>
      <types>DocumentRef.Приложение2КНалоговойНакладной</types>
      <types>DocumentRef.Партия</types>
      <types>DocumentRef.ПоступлениеДопРасходов</types>
      <types>DocumentRef.ПринятиеКУчетуНМА</types>
      <types>DocumentRef.СписаниеНМА</types>
      <types>DocumentRef.ПеремещениеТоваров</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Бух_тест/src/InformationRegisters/ДополнительныеСведения/ДополнительныеСведения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДополнительныеСведения</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>BusinessProcessRef</types>
      <types>DocumentRef</types>
      <types>TaskRef</types>
      <types>CatalogRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Свойство</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Бух_тест/src/InformationRegisters/ЛицевыеСчетаСотрудниковПоЗарплатнымПроектам/ЛицевыеСчетаСотрудниковПоЗарплатнымПроектам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЛицевыеСчетаСотрудниковПоЗарплатнымПроектам</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>НомерЛицевогоСчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗарплатныйПроект</name>
    <type>
      <types>CatalogRef.ЗарплатныеПроекты</types>
    </type>
  </resources>
  <attributes>
    <name>Документ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Банк</name>
    <type>
      <types>CatalogRef.Банки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Бух_тест/src/CommonModules/УправлениеДоступомБП/Module.bsl
Процедура ПриЗаполненииПоставляемыхПрофилейГруппДоступа(ОписанияПрофилей, ПараметрыОбновления) Экспорт
	
	// Описание для заполнения профиля "Бухгалтер".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = "ea55b08d-7d30-11e0-b9a7-20cf30c960bf";
	ОписаниеПрофиля.Наименование  = НСтр("ru='Бухгалтер';uk='Бухгалтер'", Локализация.КодЯзыкаИнформационнойБазы());
	ОписаниеПрофиля.Роли.Добавить           (  "ДобавлениеИзменениеДанныхБухгалтерии"                   );
	ОписаниеПрофиля.Роли.Добавить           (  "БазовыеПрава"                                           );
	ОписаниеПрофиля.Роли.Добавить           (  "БазовыеПраваЗарплатаКадры"                              );
	ОписаниеПрофиля.Роли.Добавить           (  "ВыводНаПринтерФайлБуферОбмена"                          );
	ОписаниеПрофиля.Роли.Добавить           (  "ДобавлениеИзменениеРазделяемыхДанныхРегламентированнойОтчетности");
	ОписаниеПрофиля.Роли.Добавить           (  "ДобавлениеИзменениеБухгалтерскогоУчетаЗарплаты"         );
	ОписаниеПрофиля.Роли.Добавить           (  "ДобавлениеИзменениеВыплаченнойЗарплаты"                 );	
	ОписаниеПрофиля.Роли.Добавить           (  "ДобавлениеИзменениеДанныхСотрудников"                   );
	ОписаниеПрофиля.Роли.Добавить           (  "ДобавлениеИзменениеНалоговИВзносов"                     );
	ОписаниеПрофиля.Роли.Добавить           (  "ДобавлениеИзменениеНачисленнойЗарплаты"                 );
	ОписаниеПрофиля.Роли.Добавить           (  "ДобавлениеИзменениеДанныхФизическихЛицЗарплатаКадры"    );
	ОписаниеПрофиля.Роли.Добавить           (  "ЗапускВебКлиента"                                       );
	ОписаниеПрофиля.Роли.Добавить           (  "ЗапускТонкогоКлиента"                                   );
	ОписаниеПрофиля.Роли.Добавить           (  "ИзменениеДополнительныхСведений"                        );
	ОписаниеПрофиля.Роли.Добавить           (  "ИзменениеМакетовПечатныхФорм"                           );
	ОписаниеПрофиля.Роли.Добавить           (  "ИзменениеТекущегоПользователя"                          );
	ОписаниеПрофиля.Роли.Добавить           (  "ИспользованиеДополнительныхОтчетовИОбработок"           );
	ОписаниеПрофиля.Роли.Добавить           (  "ИспользованиеСтруктурыПодчиненности"                    );
	ОписаниеПрофиля.Роли.Добавить           (  "ЧтениеБазовойНСИ"                                       );	
	ОписаниеПрофиля.Роли.Добавить           (  "ИспользованиеИнформационногоЦентра"                     );
	ОписаниеПрофиля.Роли.Добавить           (  "ЧтениеОбщейБухгалтерскойНСИ"                            );
	ОписаниеПрофиля.Роли.Добавить           (  "ЧтениеДанныхДляНачисленияЗарплаты"			            );
	ОписаниеПрофиля.Роли.Добавить           (  "СохранениеДанныхПользователя"                           );
	ОписаниеПрофиля.Роли.Добавить           (  "ДобавлениеИзменениеВариантовОтчетов"                    );
	ОписаниеПрофиля.Роли.Добавить           (  "ИспользованиеВариантовОтчетов"                          );
	ОписаниеПрофиля.Роли.Добавить           (  "ВыполнениеСинхронизацииДанных"                          );
	ОписаниеПрофиля.Роли.Добавить           (  "ДобавлениеИзменениеДепонированнойЗарплаты"              );	
	ОписаниеПрофиля.Роли.Добавить           (  "ДобавлениеИзменениеДанныхДляНачисленияЗарплаты"         );	
	ОписаниеПрофиля.Роли.Добавить           (  "ДобавлениеИзменениеИсходящейСправкиОЗаработке"          );
	ОписаниеПрофиля.Роли.Добавить           (  "ПросмотрОписанияИзмененийПрограммы"                     );
	ОписаниеПрофиля.Роли.Добавить           (  "ОтражениеЗарплатыВБухгалтерскомУчете"                   );
	ОписаниеПрофиля.Роли.Добавить           (  "ДобавлениеИзменениеКадровогоСостояния"                  );
	ОписаниеПрофиля.Роли.Добавить           (  "ДобавлениеИзменениеСтранМира"                           );
	ОписаниеПрофиля.Роли.Добавить           (  "ЧтениеОбщейБазовойНСИ"                                  );
	ОписаниеПрофиля.Роли.Добавить           (  "ФормированиеПечатныхФормНаВсехДоступныхЯзыках"          );
	
	Если НЕ ОбщегоНазначенияПовтИсп.РазделениеВключено() Тогда
		ОписаниеПрофиля.Роли.Добавить       (  "ДобавлениеИзменениеОбщейБухгалтерскойНСИ"               );
	Иначе
		ОписаниеПрофиля.Роли.Добавить       (  "ЧтениеОбщейБухгалтерскойНСИ"                            );
		ОписаниеПрофиля.Роли.Добавить       (  "ЧтениеДанныхРегламентированнойОтчетности"               );
	КонецЕсли;
	ОписаниеПрофиля.ВидыДоступа.Добавить    (      "Организации"                                        );
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

	// Описание для заполнения профиля "Главный бухгалтер".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = "62730c03-81d6-11e0-a42a-be487808c52b";
	ОписаниеПрофиля.Наименование  = НСтр("ru='Главный бухгалтер';uk='Головний бухгалтер'", Локализация.КодЯзыкаИнформационнойБазы());
	ОписаниеПрофиля.Роли.Добавить           (  "ДобавлениеИзменениеНастроекБухгалтерии"                 );
	ОписаниеПрофиля.Роли.Добавить           (  "ДобавлениеИзменениеДанныхБухгалтерии"                   );
	ОписаниеПрофиля.Роли.Добавить           (  "БазовыеПрава"                                           );
	ОписаниеПрофиля.Роли.Добавить           (  "БазовыеПраваЗарплатаКадры"                              );
	ОписаниеПрофиля.Роли.Добавить           (  "ВыводНаПринтерФайлБуферОбмена"                          );
	ОписаниеПрофиля.Роли.Добавить           (  "ДобавлениеИзменениеБазовойНСИ"                          );
	ОписаниеПрофиля.Роли.Добавить           (  "ДобавлениеИзменениеБухгалтерскогоУчетаЗарплаты"         );
	ОписаниеПрофиля.Роли.Добавить           (  "ДобавлениеИзменениеВыплаченнойЗарплаты"                 );
	ОписаниеПрофиля.Роли.Добавить           (  "ДобавлениеИзменениеДанныхСотрудников"                   );
	ОписаниеПрофиля.Роли.Добавить           (  "ДобавлениеИзменениеНачисленнойЗарплаты"                 );
	ОписаниеПрофиля.Роли.Добавить           (  "ДобавлениеИзменениеРазделяемыхДанныхРегламентированнойОтчетности");
	ОписаниеПрофиля.Роли.Добавить           (  "ДобавлениеИзменениеНалоговИВзносов"                     );
	ОписаниеПрофиля.Роли.Добавить           (  "ДобавлениеИзменениеДанныхФизическихЛицЗарплатаКадры"    );
	ОписаниеПрофиля.Роли.Добавить           (  "ЗапускВебКлиента"                                       );
	ОписаниеПрофиля.Роли.Добавить           (  "ЗапускТонкогоКлиента"                                   );
	ОписаниеПрофиля.Роли.Добавить           (  "ИзменениеДополнительныхСведений"                        );
	ОписаниеПрофиля.Роли.Добавить           (  "ИзменениеМакетовПечатныхФорм"                           );
	ОписаниеПрофиля.Роли.Добавить           (  "ИзменениеТекущегоПользователя"                          );
	ОписаниеПрофиля.Роли.Добавить           (  "ИспользованиеДополнительныхОтчетовИОбработок"           );
	ОписаниеПрофиля.Роли.Добавить           (  "ИспользованиеСтруктурыПодчиненности"                    );
	ОписаниеПрофиля.Роли.Добавить           (  "РедактированиеРеквизитовОбъектов"                       );
	ОписаниеПрофиля.Роли.Добавить           (  "ИспользованиеИнформационногоЦентра"                     );
	ОписаниеПрофиля.Роли.Добавить           (  "СохранениеДанныхПользователя"                           );
	ОписаниеПрофиля.Роли.Добавить           (  "ДобавлениеИзменениеВариантовОтчетов"                    );
	ОписаниеПрофиля.Роли.Добавить           (  "ИспользованиеВариантовОтчетов"                          );
	ОписаниеПрофиля.Роли.Добавить           (  "ВыполнениеСинхронизацииДанных"                          );
	ОписаниеПрофиля.Роли.Добавить           (  "ДобавлениеИзменениеДепонированнойЗарплаты"              );
	ОписаниеПрофиля.Роли.Добавить           (  "ДобавлениеИзменениеДанныхДляНачисленияЗарплаты"         );
	ОписаниеПрофиля.Роли.Добавить           (  "НастройкаБухгалтерскогоУчетаЗарплаты"                   );
	ОписаниеПрофиля.Роли.Добавить           (  "НастройкаНалогиИВзносы"                                 );
	ОписаниеПрофиля.Роли.Добавить           (  "НастройкаНалогиИВзносыОбщиеДанные"                      );
	ОписаниеПрофиля.Роли.Добавить           (  "НастройкаНачисленияЗарплаты"                            );
	ОписаниеПрофиля.Роли.Добавить           (  "НастройкаКадровыхДанных"					            );
	ОписаниеПрофиля.Роли.Добавить           (  "ДобавлениеИзменениеИсходящейСправкиОЗаработке"          );
	ОписаниеПрофиля.Роли.Добавить           (  "ПросмотрОписанияИзмененийПрограммы"                     );
	ОписаниеПрофиля.Роли.Добавить           (  "ОтражениеЗарплатыВБухгалтерскомУчете"                   );
	ОписаниеПрофиля.Роли.Добавить           (  "ДобавлениеИзменениеКадровогоСостояния"                  );
	ОписаниеПрофиля.Роли.Добавить           (  "ДобавлениеИзменениеСтранМира"                           );
	ОписаниеПрофиля.Роли.Добавить           (  "ФормированиеПечатныхФормНаВсехДоступныхЯзыках"          );
	
	Если НЕ ОбщегоНазначенияПовтИсп.РазделениеВключено() Тогда	
		ОписаниеПрофиля.Роли.Добавить       (  "ДобавлениеИзменениеОбщейБазовойНСИ"                     );
		ОписаниеПрофиля.Роли.Добавить       (  "ДобавлениеИзменениеОбщейБухгалтерскойНСИ"               );
	Иначе
		ОписаниеПрофиля.Роли.Добавить       (  "ЧтениеОбщейБухгалтерскойНСИ"                            );
		ОписаниеПрофиля.Роли.Добавить       (  "ЧтениеБазовойНСИ"                                       );
		ОписаниеПрофиля.Роли.Добавить       (  "ЧтениеДанныхРегламентированнойОтчетности"               );
	КонецЕсли;
	ОписаниеПрофиля.ВидыДоступа.Добавить    (      "Организации"                                        );
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

	// Описание для заполнения профиля "Только просмотр ".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = "45ce5549-ade3-11e0-9746-00179a3853da";
	ОписаниеПрофиля.Наименование  = НСтр("ru='Только просмотр';uk='Тільки перегляд'", Локализация.КодЯзыкаИнформационнойБазы());
	ОписаниеПрофиля.Роли.Добавить           (  "БазовыеПрава"                                );
	ОписаниеПрофиля.Роли.Добавить           (  "БазовыеПраваЗарплатаКадры"                   );
	ОписаниеПрофиля.Роли.Добавить           (  "ЧтениеБазовойНСИ"                            );
	ОписаниеПрофиля.Роли.Добавить           (  "ЧтениеДанныхБухгалтерии"                     );
	ОписаниеПрофиля.Роли.Добавить           (  "ЧтениеДанныхРегламентированнойОтчетности"    );
	ОписаниеПрофиля.Роли.Добавить           (  "ЧтениеДополнительныхСведений"                );
	ОписаниеПрофиля.Роли.Добавить           (  "ЧтениеОбщейБухгалтерскойНСИ"                 );
	ОписаниеПрофиля.Роли.Добавить           (  "ИспользованиеСтруктурыПодчиненности"         );
	ОписаниеПрофиля.Роли.Добавить           (  "ЗапускВебКлиента"                            );
	ОписаниеПрофиля.Роли.Добавить           (  "ЗапускТонкогоКлиента"                        );
	ОписаниеПрофиля.Роли.Добавить           (  "ЧтениеВнешнихПользователей"                  );
	ОписаниеПрофиля.Роли.Добавить           (  "ЧтениеБухгалтерскогоУчетаЗарплаты"           );
	ОписаниеПрофиля.Роли.Добавить           (  "ЧтениеНачисленнойЗарплаты"                   );
	ОписаниеПрофиля.Роли.Добавить           (  "ЧтениеНалоговИВзносов"                       );
	ОписаниеПрофиля.Роли.Добавить           (  "ЧтениеДанныхСотрудников"                     );
	ОписаниеПрофиля.Роли.Добавить           (  "ЧтениеВыплаченнойЗарплаты"                   );
	ОписаниеПрофиля.Роли.Добавить           (  "ЧтениеДанныхФизическихЛицЗарплатаКадры"      );
	ОписаниеПрофиля.Роли.Добавить           (  "ИспользованиеИнформационногоЦентра"          );
	ОписаниеПрофиля.Роли.Добавить           (  "СохранениеДанныхПользователя"                );
	ОписаниеПрофиля.Роли.Добавить           (  "ИспользованиеВариантовОтчетов"               );
	ОписаниеПрофиля.Роли.Добавить           (  "ЧтениеДепонированнойЗарплаты"                );
	ОписаниеПрофиля.Роли.Добавить           (  "ЧтениеДанныхДляНачисленияЗарплаты"			 );
	ОписаниеПрофиля.Роли.Добавить           (  "ЧтениеИсходящейСправкиОЗаработке"            );
	ОписаниеПрофиля.Роли.Добавить           (  "ПросмотрОписанияИзмененийПрограммы"          );
	ОписаниеПрофиля.Роли.Добавить           (  "ИспользованиеДополнительныхОтчетовИОбработок");
	ОписаниеПрофиля.Роли.Добавить           (  "ЧтениеКадровогоСостояния"                    );
	ОписаниеПрофиля.ВидыДоступа.Добавить    (  "Организации"                                 );
	ОписаниеПрофиля.Роли.Добавить           (  "ЧтениеОбщейБазовойНСИ"                       );
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// УПРАВЛЕНИЕ ДОСТУПОМ

Процедура ЗаполнитьВидыОграниченийПравОбъектовМетаданных(Описание) Экспорт
	
	Описание = Описание +  
	"
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.Организации
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.ПапкиФайлов
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.Организации
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.ПапкиФайлов
	|Справочник.ВнешниеПользователи.Чтение.ВнешниеПользователи
	|Справочник.ВнешниеПользователи.Изменение.ВнешниеПользователи
	|Справочник.ГруппыВнешнихПользователей.Чтение.ВнешниеПользователи
	|Справочник.ГруппыПользователей.Чтение.Пользователи
	|Справочник.ДоговорыКонтрагентов.Чтение.Организации
	|Справочник.ДоговорыКонтрагентов.Изменение.Организации
	|Справочник.ЗарплатныеПроекты.Чтение.Организации
	|Справочник.ЗарплатныеПроекты.Изменение.Организации
	|Справочник.ЗначенияСвойствОбъектов.Чтение.ДополнительныеСведения
	|Справочник.ЗначенияСвойствОбъектовИерархия.Чтение.ДополнительныеСведения
	|Справочник.Организации.Чтение.Организации
	|Справочник.Организации.Изменение.Организации
	|Справочник.ОрганизацииПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПапкиФайлов.Чтение.НастройкиПрав.Справочник.ПапкиФайлов
	|Справочник.ПапкиФайлов.Изменение.НастройкиПрав.Справочник.ПапкиФайлов
	|Справочник.ПодразделенияОрганизаций.Чтение.Организации
	|Справочник.ПодразделенияОрганизаций.Изменение.Организации
	|Справочник.Пользователи.Чтение.Пользователи
	|Справочник.Пользователи.Изменение.Пользователи
	|Справочник.Сотрудники.Чтение.Объект.Справочник.Сотрудники
	|Справочник.Сотрудники.Изменение.Объект.Справочник.Сотрудники
	|Справочник.УчетныеЗаписиЭлектроннойПочты.Чтение.УчетныеЗаписиЭлектроннойПочты
	|Справочник.Файлы.Чтение.Объект.Справочник.Организации
	|Справочник.Файлы.Чтение.Объект.Справочник.ПапкиФайлов
	|Справочник.Файлы.Изменение.Объект.Справочник.Организации
	|Справочник.Файлы.Изменение.Объект.Справочник.ПапкиФайлов
	|Документ.АвансовыйОтчет.Чтение.Организации
	|Документ.АвансовыйОтчет.Изменение.Организации
	|Документ.АктОбОказанииПроизводственныхУслуг.Чтение.Организации
	|Документ.АктОбОказанииПроизводственныхУслуг.Изменение.Организации
	|Документ.АктСверкиВзаиморасчетов.Чтение.Организации
	|Документ.АктСверкиВзаиморасчетов.Изменение.Организации
	|Документ.ВводНачальныхОстатков.Чтение.Организации
	|Документ.ВводНачальныхОстатков.Изменение.Организации
	|Документ.ВедомостьНаВыплатуЗарплаты.Чтение.Организации
	|Документ.ВедомостьНаВыплатуЗарплаты.Изменение.Организации
	|Документ.ВедомостьНаВыплатуЗарплатыВБанк.Чтение.Организации
	|Документ.ВедомостьНаВыплатуЗарплатыВБанк.Изменение.Организации
	|Документ.ВедомостьНаВыплатуЗарплатыВКассу.Чтение.Организации
	|Документ.ВедомостьНаВыплатуЗарплатыВКассу.Изменение.Организации
	|Документ.ВозвратТоваровОтПокупателя.Чтение.Организации
	|Документ.ВозвратТоваровОтПокупателя.Изменение.Организации
	|Документ.ВозвратТоваровПоставщику.Чтение.Организации
	|Документ.ВозвратТоваровПоставщику.Изменение.Организации
	|Документ.ВыгрузкаРегламентированныхОтчетов.Чтение.Организации
	|Документ.ВыгрузкаРегламентированныхОтчетов.Изменение.Организации
	|Документ.ВыработкаНМА.Чтение.Организации
	|Документ.ВыработкаНМА.Изменение.Организации
	|Документ.ВыработкаОС.Чтение.Организации
	|Документ.ВыработкаОС.Изменение.Организации
	|Документ.ГТДИмпорт.Чтение.Организации
	|Документ.ГТДИмпорт.Изменение.Организации
	|Документ.Доверенность.Чтение.Организации
	|Документ.Доверенность.Изменение.Организации
	|Документ.ДокументРасчетовСКонтрагентом.Чтение.Организации
	|Документ.ДокументРасчетовСКонтрагентом.Изменение.Организации
	|Документ.ИзменениеГрафиковАмортизацииОС.Чтение.Организации
	|Документ.ИзменениеГрафиковАмортизацииОС.Изменение.Организации
	|Документ.ИзменениеПараметровНачисленияАмортизацииОС.Чтение.Организации
	|Документ.ИзменениеПараметровНачисленияАмортизацииОС.Изменение.Организации
	|Документ.ИзменениеСостоянияОС.Чтение.Организации
	|Документ.ИзменениеСостоянияОС.Изменение.Организации
	|Документ.ИзменениеСпособовОтраженияРасходовПоАмортизацииНМА.Чтение.Организации
	|Документ.ИзменениеСпособовОтраженияРасходовПоАмортизацииНМА.Изменение.Организации
	|Документ.ИзменениеСпособовОтраженияРасходовПоАмортизацииОС.Чтение.Организации
	|Документ.ИзменениеСпособовОтраженияРасходовПоАмортизацииОС.Изменение.Организации
	|Документ.ИнвентаризацияНЗП.Чтение.Организации
	|Документ.ИнвентаризацияНЗП.Изменение.Организации
	|Документ.ИнвентаризацияОС.Чтение.Организации
	|Документ.ИнвентаризацияОС.Изменение.Организации
	|Документ.ИнвентаризацияРасчетовСКонтрагентами.Чтение.Организации
	|Документ.ИнвентаризацияРасчетовСКонтрагентами.Изменение.Организации
	|Документ.ИнвентаризацияТоваровНаСкладе.Чтение.Организации
	|Документ.ИнвентаризацияТоваровНаСкладе.Изменение.Организации
	|Документ.КомплектацияНоменклатуры.Чтение.Организации
	|Документ.КомплектацияНоменклатуры.Изменение.Организации
	|Документ.КорректировкаДолга.Чтение.Организации
	|Документ.КорректировкаДолга.Изменение.Организации
	|Документ.МодернизацияОС.Чтение.Организации
	|Документ.МодернизацияОС.Изменение.Организации
	|Документ.НачислениеЗарплаты.Чтение.Организации
	|Документ.НачислениеЗарплаты.Изменение.Организации
	|Документ.ОперацияБух.Чтение.Организации
	|Документ.ОперацияБух.Изменение.Организации
	|Документ.ОприходованиеТоваров.Чтение.Организации
	|Документ.ОприходованиеТоваров.Изменение.Организации
	|Документ.ОтражениеЗарплатыВБухучете.Чтение.Организации
	|Документ.ОтражениеЗарплатыВБухучете.Изменение.Организации
	|Документ.ОтчетКомиссионераОПродажах.Чтение.Организации
	|Документ.ОтчетКомиссионераОПродажах.Изменение.Организации
	|Документ.ОтчетКомитентуОПродажах.Чтение.Организации
	|Документ.ОтчетКомитентуОПродажах.Изменение.Организации
	|Документ.ОтчетОРозничныхПродажах.Чтение.Организации
	|Документ.ОтчетОРозничныхПродажах.Изменение.Организации
	|Документ.ОтчетПроизводстваЗаСмену.Чтение.Организации
	|Документ.ОтчетПроизводстваЗаСмену.Изменение.Организации
	|Документ.Партия.Чтение.Организации
	|Документ.Партия.Изменение.Организации
	|Документ.ПартияМалоценныхАктивовВЭксплуатации.Чтение.Организации
	|Документ.ПартияМалоценныхАктивовВЭксплуатации.Изменение.Организации
	|Документ.ПередачаМалоценныхАктивовВЭксплуатацию.Чтение.Организации
	|Документ.ПередачаМалоценныхАктивовВЭксплуатацию.Изменение.Организации
	|Документ.ПередачаНМА.Чтение.Организации
	|Документ.ПередачаНМА.Изменение.Организации
	|Документ.ПередачаОборудованияВМонтаж.Чтение.Организации
	|Документ.ПередачаОборудованияВМонтаж.Изменение.Организации
	|Документ.ПередачаОС.Чтение.Организации
	|Документ.ПередачаОС.Изменение.Организации
	|Документ.ПередачаТоваров.Чтение.Организации
	|Документ.ПередачаТоваров.Изменение.Организации
	|Документ.ПеремещениеОС.Чтение.Организации
	|Документ.ПеремещениеОС.Изменение.Организации
	|Документ.ПеремещениеТоваров.Чтение.Организации
	|Документ.ПеремещениеТоваров.Изменение.Организации
	|Документ.ПереоценкаТоваровВРознице.Чтение.Организации
	|Документ.ПереоценкаТоваровВРознице.Изменение.Организации
	|Документ.ПлатежноеПоручение.Чтение.Организации
	|Документ.ПлатежноеПоручение.Изменение.Организации
	|Документ.ПодготовкаКПередачеОС.Чтение.Организации
	|Документ.ПодготовкаКПередачеОС.Изменение.Организации
	|Документ.ПоступлениеДопРасходов.Чтение.Организации
	|Документ.ПоступлениеДопРасходов.Изменение.Организации
	|Документ.ПоступлениеИзПереработки.Чтение.Организации
	|Документ.ПоступлениеИзПереработки.Изменение.Организации
	|Документ.ПоступлениеНаРасчетныйСчет.Чтение.Организации
	|Документ.ПоступлениеНаРасчетныйСчет.Изменение.Организации
	|Документ.ПоступлениеНМА.Чтение.Организации
	|Документ.ПоступлениеНМА.Изменение.Организации
	|Документ.ПоступлениеТоваровУслуг.Чтение.Организации
	|Документ.ПоступлениеТоваровУслуг.Изменение.Организации
	|Документ.ПриемНаРаботу.Чтение.Организации
	|Документ.ПриемНаРаботу.Изменение.Организации
	|Документ.ПринятиеКУчетуНМА.Чтение.Организации
	|Документ.ПринятиеКУчетуНМА.Изменение.Организации
	|Документ.ВводВЭксплуатациюОС.Чтение.Организации
	|Документ.ВводВЭксплуатациюОС.Изменение.Организации
	|Документ.ПриходныйКассовыйОрдер.Чтение.Организации
	|Документ.ПриходныйКассовыйОрдер.Изменение.Организации
	|Документ.РасходныйКассовыйОрдер.Чтение.Организации
	|Документ.РасходныйКассовыйОрдер.Изменение.Организации
	|Документ.РеализацияТоваровУслуг.Чтение.Организации
	|Документ.РеализацияТоваровУслуг.Изменение.Организации
	|Документ.РеализацияУслугПоПереработке.Чтение.Организации
	|Документ.РеализацияУслугПоПереработке.Изменение.Организации
	|Документ.РегистрУчета.Чтение.Организации
	|Документ.РегистрУчета.Изменение.Организации
	|Документ.РегламентированныйОтчет.Чтение.Организации
	|Документ.РегламентированныйОтчет.Изменение.Организации
	|Документ.СписаниеМалоценныхАктивовИзЭксплуатации.Чтение.Организации
	|Документ.СписаниеМалоценныхАктивовИзЭксплуатации.Изменение.Организации
	|Документ.СписаниеНМА.Чтение.Организации
	|Документ.СписаниеНМА.Изменение.Организации
	|Документ.СписаниеОС.Чтение.Организации
	|Документ.СписаниеОС.Изменение.Организации
	|Документ.СписаниеСРасчетногоСчета.Чтение.Организации
	|Документ.СписаниеСРасчетногоСчета.Изменение.Организации
	|Документ.СписаниеТоваров.Чтение.Организации
	|Документ.СписаниеТоваров.Изменение.Организации
	|Документ.СчетНаОплатуПокупателю.Чтение.Организации
	|Документ.СчетНаОплатуПокупателю.Изменение.Организации
	|Документ.СчетНаОплатуПоставщика.Чтение.Организации
	|Документ.СчетНаОплатуПоставщика.Изменение.Организации
	|Документ.ТребованиеНакладная.Чтение.Организации
	|Документ.ТребованиеНакладная.Изменение.Организации
	|Документ.Увольнение.Чтение.Организации
	|Документ.Увольнение.Изменение.Организации
	|Документ.УстановкаПорядкаЗакрытияПодразделений.Чтение.Организации
	|Документ.УстановкаПорядкаЗакрытияПодразделений.Изменение.Организации
	|ЖурналДокументов.БанковскиеВыписки.Чтение.Организации
	|ЖурналДокументов.ДокументыПокупателей.Чтение.Организации
	|ЖурналДокументов.ДокументыПоНМА.Чтение.Организации
	|ЖурналДокументов.ДокументыПоОС.Чтение.Организации
	|ЖурналДокументов.ДокументыПоставщиков.Чтение.Организации
	|ЖурналДокументов.ЖурналОпераций.Чтение.Организации
	|ЖурналДокументов.КадровыеДокументы.Чтение.Объект.Документ.КадровыйПеревод
	|ЖурналДокументов.КадровыеДокументы.Чтение.Объект.Документ.ПриемНаРаботу
	|ЖурналДокументов.КадровыеДокументы.Чтение.Объект.Документ.Увольнение
	|ЖурналДокументов.КассовыеДокументы.Чтение.Организации
	|ЖурналДокументов.ПараметрыАмортизацииНМА.Чтение.Организации
	|ЖурналДокументов.ПараметрыАмортизацииОС.Чтение.Организации
	|ЖурналДокументов.ПроизводственныеДокументы.Чтение.Организации
	|ЖурналДокументов.СкладскиеДокументы.Чтение.Организации
	|ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения.Чтение.ДополнительныеСведения
	|РегистрСведений.БухучетЗарплатыОрганизаций.Чтение.Организации
	|РегистрСведений.БухучетЗарплатыОрганизаций.Изменение.Организации
	|РегистрСведений.ГрафикиАмортизацииОСБухгалтерскийУчет.Чтение.Организации
	|РегистрСведений.ГрафикиАмортизацииОСБухгалтерскийУчет.Изменение.Организации
	|РегистрСведений.ДанныеПервичныхДокументов.Чтение.Организации
	|РегистрСведений.ДанныеПервичныхДокументов.Изменение.Организации
	|РегистрСведений.ДатыВводаНачальныхОстатков.Чтение.Организации
	|РегистрСведений.ДатыВводаНачальныхОстатков.Изменение.Организации
	|РегистрСведений.ДополнительныеСведения.Чтение.ДополнительныеСведения
	|РегистрСведений.ДополнительныеСведения.Изменение.ДополнительныеСведения
	|РегистрСведений.КадроваяИсторияСотрудников.Чтение.Организации
	|РегистрСведений.КадроваяИсторияСотрудников.Изменение.Организации
	|РегистрСведений.ЛицевыеСчетаСотрудниковПоЗарплатнымПроектам.Чтение.Организации
	|РегистрСведений.ЛицевыеСчетаСотрудниковПоЗарплатнымПроектам.Изменение.Организации
	|РегистрСведений.МестонахождениеОСБухгалтерскийУчет.Чтение.Организации
	|РегистрСведений.МестонахождениеОСБухгалтерскийУчет.Изменение.Организации
	|РегистрСведений.МетодыРаспределенияКосвенныхРасходовОрганизаций.Чтение.Организации
	|РегистрСведений.МетодыРаспределенияКосвенныхРасходовОрганизаций.Изменение.Организации
	|РегистрСведений.НастройкиОбменаСКлиентомБанка.Чтение.Организации
	|РегистрСведений.НастройкиОбменаСКлиентомБанка.Изменение.Организации
	|РегистрСведений.НастройкиУчетаЗарплаты.Чтение.Организации
	|РегистрСведений.НастройкиУчетаЗарплаты.Изменение.Организации
	|РегистрСведений.НастройкиЭДО1СЗвит.Чтение.Организации
	|РегистрСведений.НастройкиЭДО1СЗвит.Изменение.Организации
	|РегистрСведений.НачислениеАмортизацииОСБухгалтерскийУчет.Чтение.Организации
	|РегистрСведений.НачислениеАмортизацииОСБухгалтерскийУчет.Изменение.Организации
	|РегистрСведений.НачислениеАмортизацииОСНалоговыйУчет.Чтение.Организации
	|РегистрСведений.НачислениеАмортизацииОСНалоговыйУчет.Изменение.Организации
	|РегистрСведений.ОбъектыСтроительстваОрганизаций.Чтение.Организации
	|РегистрСведений.ОбъектыСтроительстваОрганизаций.Изменение.Организации
	|РегистрСведений.ОплатаВедомостейНаВыплатуЗарплаты.Чтение.Организации
	|РегистрСведений.ОплатаВедомостейНаВыплатуЗарплаты.Изменение.Организации
	|РегистрСведений.ОтветственныеЛицаОрганизаций.Чтение.Организации
	|РегистрСведений.ОтветственныеЛицаОрганизаций.Изменение.Организации
	|РегистрСведений.ОтражениеВРегламентированномУчетеНастройкиОрганизаций.Чтение.Организации
	|РегистрСведений.ОтражениеВРегламентированномУчетеНастройкиОрганизаций.Изменение.Организации
	|РегистрСведений.ПараметрыАмортизацииОСБухгалтерскийУчет.Чтение.Организации
	|РегистрСведений.ПараметрыАмортизацииОСБухгалтерскийУчет.Изменение.Организации
	|РегистрСведений.ПараметрыАмортизацииОСНалоговыйУчет.Чтение.Организации
	|РегистрСведений.ПараметрыАмортизацииОСНалоговыйУчет.Изменение.Организации
	|РегистрСведений.ПервоначальныеСведенияНМАБухгалтерскийУчет.Чтение.Организации
	|РегистрСведений.ПервоначальныеСведенияНМАБухгалтерскийУчет.Изменение.Организации
	|РегистрСведений.ПервоначальныеСведенияНМАНалоговыйУчет.Чтение.Организации
	|РегистрСведений.ПервоначальныеСведенияНМАНалоговыйУчет.Изменение.Организации
	|РегистрСведений.ПервоначальныеСведенияОСБухгалтерскийУчет.Чтение.Организации
	|РегистрСведений.ПервоначальныеСведенияОСБухгалтерскийУчет.Изменение.Организации
	|РегистрСведений.ПервоначальныеСведенияОСНалоговыйУчет.Чтение.Организации
	|РегистрСведений.ПервоначальныеСведенияОСНалоговыйУчет.Изменение.Организации
	|РегистрСведений.ПорядокЗакрытияПодразделенийОрганизаций.Чтение.Организации
	|РегистрСведений.ПорядокЗакрытияПодразделенийОрганизаций.Изменение.Организации
	|РегистрСведений.РасчетПереоценкиВалютныхСредств.Чтение.Организации
	|РегистрСведений.РасчетПереоценкиВалютныхСредств.Изменение.Организации
	|РегистрСведений.РасчетРаспределенияКосвенныхРасходов.Чтение.Организации
	|РегистрСведений.РасчетРаспределенияКосвенныхРасходов.Изменение.Организации
	|РегистрСведений.РасчетСписанияРБП.Чтение.Организации
	|РегистрСведений.РасчетСписанияРБП.Изменение.Организации
	|РегистрСведений.СобытияОСОрганизаций.Чтение.Организации
	|РегистрСведений.СобытияОСОрганизаций.Изменение.Организации
	|РегистрСведений.СоставыГруппПользователей.Чтение.ВнешниеПользователи
	|РегистрСведений.СоставыГруппПользователей.Чтение.Пользователи
	|РегистрСведений.СостоянияНМАОрганизаций.Чтение.Организации
	|РегистрСведений.СостоянияНМАОрганизаций.Изменение.Организации
	|РегистрСведений.СостоянияОСОрганизаций.Чтение.Организации
	|РегистрСведений.СостоянияОСОрганизаций.Изменение.Организации
	|РегистрСведений.СпособыОтраженияРасходовПоАмортизацииНМАБухгалтерскийУчет.Чтение.Организации
	|РегистрСведений.СпособыОтраженияРасходовПоАмортизацииНМАБухгалтерскийУчет.Изменение.Организации
	|РегистрСведений.СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет.Чтение.Организации
	|РегистрСведений.СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет.Изменение.Организации
	|РегистрСведений.СчетаБухгалтерскогоУчетаНМА.Чтение.Организации
	|РегистрСведений.СчетаБухгалтерскогоУчетаНМА.Изменение.Организации
	|РегистрСведений.СчетаБухгалтерскогоУчетаОС.Чтение.Организации
	|РегистрСведений.СчетаБухгалтерскогоУчетаОС.Изменение.Организации
	|РегистрСведений.СчетаУчетаНоменклатуры.Чтение.Организации
	|РегистрСведений.СчетаУчетаНоменклатуры.Изменение.Организации
	|РегистрСведений.СчетаУчетаРасчетовСКонтрагентами.Чтение.Организации
	|РегистрСведений.СчетаУчетаРасчетовСКонтрагентами.Изменение.Организации
	|РегистрСведений.ТекущаяТарифнаяСтавкаСотрудников.Чтение.Организации
	|РегистрСведений.ТекущаяТарифнаяСтавкаСотрудников.Изменение.Организации
	|РегистрСведений.ТекущиеКадровыеДанныеСотрудников.Чтение.Организации
	|РегистрСведений.ТекущиеКадровыеДанныеСотрудников.Изменение.Организации
	|РегистрСведений.УчетнаяПолитикаОрганизаций.Чтение.Организации
	|РегистрСведений.УчетнаяПолитикаОрганизаций.Изменение.Организации
	|РегистрСведений.ХранимыеФайлыВерсий.Чтение.Объект.Справочник.Организации
	|РегистрСведений.ХранимыеФайлыВерсий.Чтение.Объект.Справочник.ПапкиФайлов
	|РегистрНакопления.ВзаиморасчетыССотрудниками.Чтение.Организации
	|РегистрНакопления.ВзаиморасчетыССотрудниками.Изменение.Организации
	|РегистрНакопления.ВыработкаНМА.Чтение.Организации
	|РегистрНакопления.ВыработкаНМА.Изменение.Организации
	|РегистрНакопления.ВыработкаОС.Чтение.Организации
	|РегистрНакопления.ВыработкаОС.Изменение.Организации
	|РегистрНакопления.НачисленияУдержанияПоСотрудникам.Чтение.Организации
	|РегистрНакопления.НачисленияУдержанияПоСотрудникам.Изменение.Организации
	|РегистрНакопления.РеализацияУслуг.Чтение.Организации
	|РегистрНакопления.РеализацияУслуг.Изменение.Организации
	|РегистрНакопления.РеализованныеТоварыКомитентов.Чтение.Организации
	|РегистрНакопления.РеализованныеТоварыКомитентов.Изменение.Организации
	|РегистрБухгалтерии.Хозрасчетный.Чтение.Организации
	|РегистрБухгалтерии.Хозрасчетный.Изменение.Организации";
	
КонецПроцедуры
